{
  "Shinkawacho, Higashi-ku, Niigata City, Niigata Prefecture": {
    "shortDescription": "Recently renovated 5K home with excellent sunlight, three parking spaces, and within walking distance to schools and sports facilities."
  },
  "Oaza Ooto, Yahiko Village, Nishikanbara District, Niigata Prefecture": {
    "shortDescription": "Spacious 8DK home with planned renovations, three-way access, and ample parking for 4 vehicles in a convenient location."
  },
  "Kanazu, Akiba Ward, Niigata City, Niigata Prefecture": {
    "shortDescription": "Renovated country house on 291 tsubo with rice fields, garden, and 6-car parking, perfect for nature lovers seeking space."
  },
  "Manohara, Shibata City, Niigata Prefecture": {
    "shortDescription": "Corner lot 7LDK home with upcoming renovations and 3 parking spaces, featuring a spacious 13.75 tatami mat living area."
  },
  "Akiba Ward, Niigata City, Niigata Prefecture": {
    "shortDescription": "Traditional Heike-built 5DK home with garden and sheds, scheduled for renovation in a peaceful rural setting."
  },
  "Izuru, Nishikan-ku, Niigata City, Niigata Prefecture": {
    "shortDescription": "South-facing 3DK with upcoming renovations, tax benefits, and spacious 10-tatami dining area with garden."
  },
  "Higashi-Osaki 2-chome, Sanjo City, Niigata Prefecture": {
    "shortDescription": "Corner 10DK property with workshop, garage and storage shed on large plot with 5 parking spaces near schools."
  },
  "Urayama 3-chome, Nishi-ku": {
    "shortDescription": "Extensively renovated 4LDK featuring generous 17.5 tatami living space and two-car parking in convenient location."
  },
  "3-chome, Shibata City, Niigata Prefecture": {
    "shortDescription": "Freshly renovated 7DK home with 30 tsubo workshop, panoramic views, and 7 parking spaces on a generous lot."
  },
  "Tawara Yanagi, Konan Ward, Niigata City, Niigata Prefecture": {
    "shortDescription": "Bright, renovated 5DK with open living environment facing a 13.3m road with 4 parking spaces and garden."
  },
  "Minami Igarashi Sancho, Nishi-ku, Niigata City, Niigata Prefecture": {
    "shortDescription": "Luxurious Western-style home with massive 33-tatami LDK, garden, garage and 6 parking spaces near schools."
  },
  "Shichi 4-chome, Higashi-ku, Niigata City, Niigata Prefecture": {
    "shortDescription": "South-facing modern 4LDK with multipurpose first-floor space, 16-tatami living area and 3 parking spaces."
  },
  "Akatsuka, Nishi-ku, Niigata City, Niigata Prefecture <Landmark B>": {
    "shortDescription": "Prime 69-tsubo plot with stunning mountain views in an excellent natural environment near schools."
  }
}